IDEA Open Model
ConcreteCheckResultBase Properties
The ConcreteCheckResultBase type exposes the following members.
Properties
Name | Description
Check
 settings of check type
CheckValue
 calculated limited value, calculated as strain to limit strain
InternalFores
 internal forces used for calculation
LimitCheckValue
 limit check value for result check
NonConformities
 Returns nonconformity in section
Result
 check result passed/failed
Top
See Also
Reference
ConcreteCheckResultBase Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace